<?php

return [
    'required' => 'Это обязательное поле',
    'max' => [
        'string' => 'Значение не должно быть длиннее :max символов',
    ],
    'email' => 'Введите корректный email',
    'unique' => 'Значение уже занято',
    'exists' => 'Выбранное значение не найдено',
    'lowercase' => 'Значение должно быть в нижнем регистре',
    'array' => 'Некорректное значение',
    'custom' => [
        'password' => [
            'min' => 'Пароль должен иметь длину не менее :min символов',
            'confirmed' => 'Пароль и подтверждение не совпадают',
        ],
        'email' => [
            'unique' => 'Пользователь с таким email уже существует',
        ],
    ],
];
